lib/tasks/dev.rake

INSERT INTO "domains" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Fox Terrier"], ["created_at", "2020-09-11 01:01:26.038479"], ["updated_at", "2020-09-11 01:01:26.038479"]]
SELECT "domains".* FROM "domains"
INSERT INTO "image_classes" ("name", "domain_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "senior"], ["domain_id", 1], ["created_at", "2020-09-11 01:01:26.067068"], ["updated_at", "2020-09-11 01:01:26.067068"]]
---
  task setup: :environment do
    p "Recording Domains"

    5.times do |i|
      Domain.create!(
        description: Faker::Creature::Dog.breed
      )
    end

    p "Domains recorded"

    p "Recording Image Classes"

    Domain.all.each { |domain_instance|
      3.times do |i|
        ImageClass.create!(
          name: Faker::Creature::Dog.age,
          domain: domain_instance
        )