app/controllers/domains_controller.rb

  def index
    @domains = Domain.all
---
SELECT "domains".* FROM "domains"

  def domain_classes(domain)
    return ImageClass.where(domain: domain.id)
---
SELECT "image_classes".* FROM "image_classes" WHERE "image_classes"."domain_id" = ?  [["domain_id", 1]]

  def create
    @domain = Domain.new(domain_params)

    if @domain.save
---
INSERT INTO "domains" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "new-domain"], ["created_at", "2020-09-04 02:00:27.205782"], ["updated_at", "2020-09-04 02:00:27.205782"]]

  def update
    if @domain.update(domain_params)
---
UPDATE "domains" SET "description" = ?, "updated_at" = ? WHERE "domains"."id" = ?  [["description", "Doug"], ["updated_at", "2020-10-06 01:06:03.085298"], ["id", 1]]

  def destroy
    @domain.destroy
---
DELETE FROM "domains" WHERE "domains"."id" = ?  [["id", 16]]

    def set_domain
      @domain = Domain.find(params[:id])
---
SELECT  "domains".* FROM "domains" WHERE "domains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]