app/controllers/image_classes_controller.rb

SELECT "image_classes".* FROM "image_classes" WHERE "image_classes"."domain_id" = ?  [["domain_id", 1]]
SELECT "image_classes".* FROM "image_classes"
---
  def index
    param_domain_id = params[:domain_id]
    if param_domain_id
      @image_classes = ImageClass.where(domain_id: param_domain_id)
    else
      @image_classes = ImageClass.all

INSERT INTO "image_classes" ("name", "domain_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Periquito"], ["domain_id", 1], ["created_at", "2020-10-07 01:58:19.921331"], ["updated_at", "2020-10-07 01:58:19.921331"]]
---
  def create
    @image_class = ImageClass.new(image_class_params)

    if @image_class.save

SELECT  "image_classes".* FROM "image_classes" WHERE "image_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_image_class
      @image_class = ImageClass.find(params[:id])